In [1]:
import pandas as pd

Q1. List any five functions of the pandas library with execution.

In [3]:
df = pd.read_csv("https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv")

In [5]:
df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [6]:
df['Fare'].min()

0.0

In [7]:
df['Fare'].max()

512.3292

In [8]:
df['Fare'].mean()

32.204207968574636

In [9]:
df.count()

PassengerId    891
Survived       891
Pclass         891
Name           891
Sex            891
Age            714
SibSp          891
Parch          891
Ticket         891
Fare           891
Cabin          204
Embarked       889
dtype: int64

Q2. Given a Pandas DataFrame df with columns 'A', 'B', and 'C', write a Python function to re-index the
DataFrame with a new index that starts from 1 and increments by 2 for each row.

In [26]:
df['A'] = 'A'

In [27]:
df['B'] = 'B'

In [28]:
df['C'] = 'C'

In [30]:
df1= df[['A','B','C']]

In [49]:
df1.index.map(lambda x : x * 2 +1)

Int64Index([   1,    3,    5,    7,    9,   11,   13,   15,   17,   19,
            ...
            1763, 1765, 1767, 1769, 1771, 1773, 1775, 1777, 1779, 1781],
           dtype='int64', length=891)

In [50]:
 df1.index = df1.index.map(lambda x : x * 2 +1)

In [52]:
df1

      A  B  C
1     A  B  C
3     A  B  C
5     A  B  C
7     A  B  C
9     A  B  C
...  .. .. ..
1773  A  B  C
1775  A  B  C
1777  A  B  C
1779  A  B  C
1781  A  B  C

[891 rows x 3 columns]

Q3. You have a Pandas DataFrame df with a column named 'Values'. Write a Python function that
iterates over the DataFrame and calculates the sum of the first three values in the 'Values' column. The
function should print the sum to the console.

In [53]:
df['Value'] = df['PassengerId']

In [57]:
df['Value'][0:3].sum()

6

Q4. Given a Pandas DataFrame df with a column 'Text', write a Python function to create a new column
'Word_Count' that contains the number of words in each row of the 'Text' column.

In [58]:
df['Text'] = df['Name']

In [82]:
df['Word_Count'] = df['Text'].apply(lambda x : len(x.split(" ")))

In [83]:
df['Word_Count']

0      4
1      7
2      3
3      7
4      4
      ..
886    3
887    4
888    5
889    4
890    3
Name: Word_Count, Length: 891, dtype: int64

Q5. How are DataFrame.size() and DataFrame.shape() different?

In [85]:
df.shape

(891, 18)

In [86]:
df.size

16038

In [ ]:
size is Return the number of rows if Series. Otherwise return the number of
rows times number of columns if DataFrame.

In [ ]:
shape is Return a tuple representing the dimensionality of the DataFrame.

Q6. Which function of pandas do we use to read an excel file?

In [89]:
df2 = pd.read_excel("LUSID Excel - Setting up your market data.xlsx")

Q7. You have a Pandas DataFrame df that contains a column named 'Email' that contains email
addresses in the format 'username@domain.com'. Write a Python function that creates a new column
'Username' in df that contains only the username part of each email address.

In [91]:
df2["email"] = "username@domain.com"

In [98]:
df2["username"] = df2["email"].str.split("@").str[0]

In [99]:
df2["username"]

0     username
1     username
2     username
3     username
4     username
5     username
6     username
7     username
8     username
9     username
10    username
11    username
12    username
13    username
14    username
15    username
16    username
17    username
18    username
19    username
20    username
21    username
22    username
23    username
24    username
25    username
26    username
27    username
Name: username, dtype: object

Q8. You have a Pandas DataFrame df with columns 'A', 'B', and 'C'. Write a Python function that selects
all rows where the value in column 'A' is greater than 5 and the value in column 'B' is less than 10. The
function should return a new DataFrame that contains only the selected rows.

In [106]:
data = {"A":[3,8,6,2,9],
       "B":[5,2,9,3,1],
       "C":[1,7,4,5,2]}

In [107]:
data

{'A': [3, 8, 6, 2, 9], 'B': [5, 2, 9, 3, 1], 'C': [1, 7, 4, 5, 2]}

In [108]:
df3 = pd.DataFrame(data)

In [111]:
df3[(df3['A'] > 5 ) & (df3['B'] < 10 )]

   A  B  C
1  8  2  7
2  6  9  4
4  9  1  2

Q9. Given a Pandas DataFrame df with a column 'Values', write a Python function to calculate the mean,
median, and standard deviation of the values in the 'Values' column.

In [115]:
df['Age'].mean()

29.69911764705882

In [117]:
df['Age'].median()

28.0

In [118]:
df['Age'].std()

14.526497332334044

Q10. Given a Pandas DataFrame df with a column 'Sales' and a column 'Date', write a Python function to
create a new column 'MovingAverage' that contains the moving average of the sales for the past 7 days
for each row in the DataFrame. The moving average should be calculated using a window of size 7 and
should include the current day.

In [120]:
df = pd.DataFrame({
    'Date': pd.date_range(start='2023-06-01', periods=10),
    'Sales': [10, 20, 15, 25, 30, 35, 40, 45, 50, 55]})

In [121]:
df

        Date  Sales
0 2023-06-01     10
1 2023-06-02     20
2 2023-06-03     15
3 2023-06-04     25
4 2023-06-05     30
5 2023-06-06     35
6 2023-06-07     40
7 2023-06-08     45
8 2023-06-09     50
9 2023-06-10     55

In [122]:
df['movingaverage'] = df['Sales'].rolling(window=7, min_periods=1).mean()

In [123]:
df

        Date  Sales  movingaverage
0 2023-06-01     10      10.000000
1 2023-06-02     20      15.000000
2 2023-06-03     15      15.000000
3 2023-06-04     25      17.500000
4 2023-06-05     30      20.000000
5 2023-06-06     35      22.500000
6 2023-06-07     40      25.000000
7 2023-06-08     45      30.000000
8 2023-06-09     50      34.285714
9 2023-06-10     55      40.000000

Q11. You have a Pandas DataFrame df with a column 'Date'. Write a Python function that creates a new
column 'Weekday' in the DataFrame. The 'Weekday' column should contain the weekday name (e.g.
Monday, Tuesday) corresponding to each date in the 'Date' column.

In [124]:
Date = ['2023-01-01','2023-01-02','2023-01-03','2023-01-04','2023-01-05']

In [134]:
df4 = df['date'][0:5]
df4 = pd.DataFrame(df4)
df4

         date
0  2023-01-01
1  2023-01-02
2  2023-01-03
3  2023-01-04
4  2023-01-05

In [135]:
df4['date'] = pd.to_datetime(df['date'])

In [136]:
df4.dtypes

date    datetime64[ns]
dtype: object

In [140]:
df4['Weekday']=df4['date'].dt.day_name()

In [141]:
df4

        date    Weekday
0 2023-01-01     Sunday
1 2023-01-02     Monday
2 2023-01-03    Tuesday
3 2023-01-04  Wednesday
4 2023-01-05   Thursday

Q12. Given a Pandas DataFrame df with a column 'Date' that contains timestamps, write a Python
function to select all rows where the date is between '2023-01-01' and '2023-01-31'.

In [143]:
df4[(df4['date'] > '2023-01-01' ) & (df4['date'] < '2023-01-31')]

        date    Weekday
1 2023-01-02     Monday
2 2023-01-03    Tuesday
3 2023-01-04  Wednesday
4 2023-01-05   Thursday

Q13. To use the basic functions of pandas, what is the first and foremost necessary library that needs to
be imported?

In [ ]:
pandas